Revit 2024 API
BuiltInFailures.LinkFailures.DataDictionaryDifferentInLink Property
 Linked file [Name] was last saved in a previous version of Revit. Changes to it cannot be saved until it is upgraded.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DataDictionaryDifferentInLink { get; }
Visual Basic
Public Shared ReadOnly Property DataDictionaryDifferentInLink As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DataDictionaryDifferentInLink {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.LinkFailures Class
Autodesk.Revit.DB Namespace